#include<random>
#include<iostream>
#include<time.h>
#include<string>
using namespace std;
string surname[] = {
    "赵", "钱", "孙", "李", "周", "吴", "郑", "王", "冯", "陈", "褚", "卫", "蒋", "沈", "韩", "杨", "朱", "秦", "尤", "许",
    "何", "吕", "施", "张", "孔", "曹", "严", "华", "金", "魏", "陶", "姜", "戚", "谢", "邹", "喻", "柏", "水", "窦", "章",
    "云", "苏", "潘", "葛", "奚", "范", "彭", "郎", "鲁", "韦", "昌", "马", "苗", "凤", "花", "方", "俞", "任", "袁", "柳",
    "酆", "鲍", "史", "唐", "费", "廉", "岑", "薛", "雷", "贺", "倪", "汤", "滕", "殷", "罗", "毕", "郝", "邬", "安", "常",
    "乐", "于", "时", "傅", "皮", "卞", "齐", "康", "伍", "余", "元", "卜", "顾", "孟", "平", "黄", "和", "穆", "萧", "尹",
    "姚", "邵", "湛", "汪", "祁", "毛", "禹", "狄", "米", "贝", "明", "臧", "计", "伏", "成", "戴", "谈", "宋", "茅", "庞",
    "熊", "纪", "舒", "屈", "项", "祝", "董", "梁", "杜", "阮", "蓝", "闵", "席", "季", "麻", "强", "贾", "路", "娄", "危",
    "江", "童", "颜", "郭", "梅", "盛", "林", "刁", "锺", "徐", "丘", "骆", "高", "夏", "蔡", "田", "樊", "胡", "凌", "霍",
    "虞", "万", "支", "柯", "昝", "管", "卢", "莫", "经", "房", "裘", "缪", "干", "解", "应", "宗", "丁", "宣", "贲", "邓",
    "郁", "单", "杭", "洪", "包", "诸", "左", "石", "崔", "吉", "钮", "龚", "程", "嵇", "邢", "滑", "裴", "陆", "荣", "翁",
    "荀", "羊", "於", "惠", "甄", "麹", "家", "封", "芮", "羿", "储", "靳", "汲", "邴", "糜", "松", "井", "段", "富", "巫",
    "乌", "焦", "巴", "弓", "牧", "隗", "山", "谷", "车", "侯", "宓", "蓬", "全", "郗", "班", "仰", "秋", "仲", "伊", "宫",
    "甯", "仇", "栾", "暴", "甘", "钭", "厉", "戎", "祖", "武", "符", "刘", "景", "詹", "束", "龙", "叶", "幸", "司", "韶",
    "郜", "黎", "蓟", "薄", "印", "宿", "白", "怀", "蒲", "邰", "从", "鄂", "索", "咸", "籍", "赖", "卓", "蔺", "屠", "蒙",
    "池", "乔", "阴", "鬱", "胥", "能", "苍", "双", "闻", "莘", "党", "翟", "谭", "贡", "劳", "逄", "姬", "申", "扶", "堵",
    "冉", "宰", "郦", "雍", "郤", "璩", "桑", "桂", "濮", "牛", "寿", "通", "边", "扈", "燕", "冀", "郏", "浦", "尚", "农",
    "温", "别", "庄", "晏", "柴", "瞿", "阎", "充", "慕", "连", "茹", "习", "宦", "艾", "鱼", "容", "向", "古", "易", "慎",
    "戈", "廖", "庾", "终", "暨", "居", "衡", "步", "都", "耿", "满", "弘", "匡", "国", "文", "寇", "广", "禄", "阙", "东",
    "欧", "殳", "沃", "利", "蔚", "越", "夔", "隆", "师", "巩", "厍", "聂", "晁", "勾", "敖", "融", "冷", "訾", "辛", "阚",
    "那", "简", "饶", "空", "曾", "毋", "沙", "乜", "养", "鞠", "须", "丰", "巢", "关", "蒯", "相", "查", "后", "荆", "红",
    "游", "竺", "权", "逯", "盖", "益", "桓", "公", "万俟", "司马", "上官", "欧阳", "夏侯", "诸葛", "闻人", "东方", "赫连", "皇甫",
    "尉迟", "公羊", "澹台", "公冶", "宗政", "濮阳", "淳于", "单于", "太叔", "申屠", "公孙", "仲孙", "轩辕", "令狐", "锺离", "宇文",
    "长孙", "慕容", "鲜于", "闾丘", "司徒", "司空", "亓官", "司寇", "仉", "督", "子车", "颛孙", "端木", "巫马", "公西", "漆雕", "乐正",
    "壤驷", "公良", "拓跋", "夹谷", "宰父", "穀梁", "晋", "楚", "闫", "法", "汝", "鄢", "涂", "钦", "段干", "百里", "东郭", "南门",
    "呼延", "归海", "羊舌", "微生", "岳", "帅", "缑", "亢", "况", "後", "有", "琴", "梁丘", "左丘", "东门", "西门", "商", "牟",
    "佘", "佴", "伯", "赏", "南宫", "墨", "哈", "谯", "笪", "年", "爱", "阳", "佟", "第五", "言", "福"
};
string boy_name[] = {
    "壮", "昱杰", "开虎", "叶行", "家越", "煜文", "家惟", "龄之", "俊有", "啸威", "浩一", "向红", "军", "建荣", "紫威", "彬",
    "作为", "博轩", "爵", "榕轩", "韦聿", "仁腾", "诏涣", "勇宁", "东阁", "寰", "春军", "翼帆", "诏炀", "培帆", "又淇", 
    "谦韵", "子柏", "永慧", "仲泉", "恒一", "恒源", "凯", "大奇", "兴宁", "笑野", "浩峰", "宪", "伟平", "彦博", "树魏", 
    "坚武", "梓华", "啸吟", "华繁", "啸宇", "健奇", "艺臣", "一同", "疾风","伟洪", "镜敏", "政浩", "子旭", "玉轩", "子林", 
    "延赤", "禾", "环球", "亚韬", "昊俊", "嘉汶", "纯德", "天宇", "盛世", "华山", "兆临", "泽光", "栗", "樯", "一辉", "闻博", 
    "国洋", "毅杰", "建可", "惠山", "谦之", "连喜", "溪俨", "学江", "树鹏", "鹏", "天友", "庆宇", "本凤", "少涛", "键程", "厚霖", 
    "泽一", "清嵘", "车亦", "新民", "志东", "剑清", "海霖", "一溪", "融渝", "玺剑", "超宇", "永润", "人月", "炳荣", "冰博", "季栋", 
    "仁赫", "兰斌", "嘉伟", "军军", "鄂", "思华", "建青", "兴华", "冀川", "赞平", "佳汛", "万鹏", "飞平", "树隶", "子桁"
};
string girl_name[] = {
    "小玉", "蓝", "琬郡", "琛青", "予舴", "妙妙", "焱诺", "艺歆", "芮熙", "悦优", "艺杨", "艺惠", "爱芬", "含因", "楚菊", "佳禾",
    "婧妗", "玉容", "文莉", "娅雯", "碧连", "芊菲", "宇娜", "志妍", "天馨", "静", "涵雅", "辰语", "瀚樱", "小捧", "丹丹", "黎腩",
    "丹华", "文璐", "芳辉", "浚丽", "才霞", "采嫦", "梦琪", "泥", "映月", "铱芳", "馨馨", "媛鑫", "紫萱", "玉春", "韶玥", "紫玉",
    "丽静", "藤娟", "朵", "贞", "佼悦", "珍宝", "千叶", "嘉琪", "丙芳", "玉琴", "丽雅", "影祺", "潇琳", "寒凝", "赛", "竹梅", "颜婷",
    "靓颖", "亦菲", "颖萌", "筵彤", "岚羽", "茜柔", "钦玥", "伊茗", "嘉韵", "花玲", "蕤", "子歌", "佛瑶", "云丽", "彩杰", "稼妮",
    "华蓉", "彦芳", "笑", "尹真", "笑榕", "语潼", "雪虹", "婧雯", "玉菡", "欣妍", "佳丽", "盈乐", "思佳", "卜鸾", "建婷", "桐菲",
    "岑", "雅彦", "婧颖", "氏艳", "舒畅"
};

string titles[] = {
    "教授",
    "副教授",
    "讲师"
};

string get_name(bool isboy) {
    string s;
    s.append(surname[rand() % 250]);
    if (isboy) {
        int id = rand() % 124;
        s.append(boy_name[id]);
    }
    else {
        int id = rand() % 102;
        s.append(girl_name[id]);
    }
    return s;
}

string get_gender() {
    int ok = rand() % 2;
    if (ok) return "男";
    else return "女";
}

string get_birth() {
    string s;
    int ok = rand() % 2;
    if (ok) s.append("2000-");
    else s.append("2001-");
    int month = rand() % 12;
    s.append(to_string(month + 1) + "-");
    int day = rand() % 28;
    s.append(to_string(day + 1));
    return s;
}

string get_title() {
    return titles[rand() % 3];
}

int main() {
    srand(time(NULL));
    int idbeg = 10000;
    for (int i = 0;i < 9;i++) {
        for (int k = 0;k < 50;k++) {
            string gender = get_gender();
            string name = get_name(gender == "男");
            string birthday = get_birth();
            string title = get_title();
            int cid;
            cid = i + 1;
            printf("insert into teacher(id,name,gender,title,college_id) value(%d,\"%s\",\"%s\",\"%s\",%d);\n", ++idbeg, name.c_str(), gender.c_str(), title.c_str(), cid);
        }
    }
}